In [1]:
print("Hello Anaconda")

Hello Anaconda

In [33]:
##reading a file using pandas
import pandas as pd
df = pd.read_csv('AMZN.csv')
df.head(50) ##for first 50
df.tail(5) ##for last five

    Date    Adj Close
48    49  1402.050049
49    50  1429.949951
50    51  1339.599976
51    52  1448.689941
52    53  1448.689941

In [34]:
df.info() ##gives you info of all the columns and the entire df, size, columns, indexes, types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 2 columns):
Date         53 non-null int64
Adj Close    53 non-null float64
dtypes: float64(1), int64(1)
memory usage: 928.0 bytes

In [4]:
print(df[0:3])
##3 is for row
##0 is for column

print(df[1:3])
##1 is for row
##3 is for column

   Date   Adj Close
0     1  845.239990
1     2  849.880005
2     3  852.460022
   Date   Adj Close
1     2  849.880005
2     3  852.460022

In [28]:
##different ways to address a column in a df
print(df['Date'].mean())
print(df['Adj Close'].mean())

27.0
1049.6626345283014
27.0

In [32]:
##to get the data type
type(df['Adj Close'])
##to get all the column names
df.columns

Index(['Date', 'Adj Close'], dtype='object')

In [35]:
##in case you find NAs in your data
df['Date'].fillna(value=df['Date'].mean())
##df.dropna() drops all the columns that have NAs. Rarely used but effective

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    23
23    24
24    25
25    26
26    27
27    28
28    29
29    30
30    31
31    32
32    33
33    34
34    35
35    36
36    37
37    38
38    39
39    40
40    41
41    42
42    43
43    44
44    45
45    46
46    47
47    48
48    49
49    50
50    51
51    52
52    53
Name: Date, dtype: int64

In [40]:
##Learn group by with a better data set
##reading an excel file
df1 = pd.read_excel("IceCreamDataSet Wayfair.xlsx",sheet_name='Sheet1')
df1.head(5)

,Weekday,Customer,Date,Flavor,Revenue,Profit,Unnamed: 6,352,256.5,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14
0,4,Drew Roulette,2018-03-01,Chocolate,4.0,3.00,NaN,Revenue,Profit,NaN,NaN,NaN,NaN,NaN,NaN
1,5,Don Frazon,2018-03-02,Vanilla,4.0,3.00,NaN,95.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,5,Erin Davidson,2018-03-02,Vanilla,4.0,3.00,NaN,Cost,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,5,Ted Price,2018-03-02,Chocolate,4.0,3.00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,profit
4,6,Lila Stevens,2018-03-03,Cookie Dough,5.0,3.75,NaN,NaN,Customer,Revenue,Profit,Profit %,Order Count,Contribution,Avg per order

In [57]:
df1.info()
##to consider only the relevant columns and saving them to the new dataframe
df2 = df1.iloc[0:85,0:6]
print(df2.head(15))
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86 entries, 0 to 85
Data columns (total 15 columns):
Weekday        86 non-null int64
Customer       86 non-null object
Date           86 non-null datetime64[ns]
Flavor         86 non-null object
Revenue        86 non-null float64
Profit         86 non-null float64
Unnamed: 6     5 non-null float64
352            8 non-null object
256.5          20 non-null object
Unnamed: 9     19 non-null object
Unnamed: 10    19 non-null object
Unnamed: 11    19 non-null object
Unnamed: 12    19 non-null object
Unnamed: 13    19 non-null object
Unnamed: 14    20 non-null object
dtypes: datetime64[ns](1), float64(3), int64(1), object(10)
memory usage: 10.2+ KB
    Weekday          Customer       Date          Flavor  Revenue  Profit
0         4     Drew Roulette 2018-03-01       Chocolate      4.0    3.00
1         5        Don Frazon 2018-03-02         Vanilla      4.0    3.00
2         5     Erin Davidson 2018-03-02         Vanilla      4.0    3.00
3         5         Ted Price 2018-03-02       Chocolate      4.0    3.00
4         6      Lila Stevens 2018-03-03    Cookie Dough      5.0    3.75
5         6     Sierra Noonan 2018-03-03    Cookie Dough      5.0    3.75
6         6    Ian Richardson 2018-03-03       Chocolate      4.0    3.00
7         7     Drew Roulette 2018-03-04  Chocolate Chip      5.0    3.75
8         7     Sean Lansfrow 2018-03-04         Vanilla      4.0    3.00
9         7  Malcolm Benjamin 2018-03-04    Cookie Dough      5.0    3.75
10        2     Erin Davidson 2018-03-06    Cookie Dough      5.0    3.75
11        2         Ted Price 2018-03-06       Chocolate      4.0    3.00
12        3   Dennis Perelman 2018-03-07    Cookie Dough      5.0    3.75
13        3      Lila Stevens 2018-03-07    Cookie Dough      5.0    3.75
14        3    Silvio Carrera 2018-03-07    Cookie Dough      5.0    3.75
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85 entries, 0 to 84
Data columns (total 6 columns):
Weekday     85 non-null int64
Customer    85 non-null object
Date        85 non-null datetime64[ns]
Flavor      85 non-null object
Revenue     85 non-null float64
Profit      85 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 4.1+ KB

In [80]:
##group by in pandas
summaryop = df2.groupby('Flavor')[['Flavor']].count()
print(summaryop)

summaryop = df2.groupby('Flavor')[['Profit']].sum()
print(summaryop)


summaryop = df2.groupby('Customer')[['Profit']].sum()
print(summaryop)

                Flavor
Flavor
Chocolate           22
Chocolate Chip      16
Cookie Dough        13
Mint Chip            8
Vanilla             26
                Profit
Flavor
Chocolate        60.00
Chocolate Chip   50.00
Cookie Dough     48.75
Mint Chip        30.00
Vanilla          64.00
                  Profit
Customer
Dennis Perelman    11.50
Don Frazon         19.50
Drew Roulette      20.50
Erin Davidson      15.75
Ian Richardson     19.75
Lila Stevens       18.75
Malcolm Benjamin   22.25
Sean Lansfrow      22.00
Sierra Noonan      34.00
Silvio Carrera     21.50
Ted Price          25.00
Tony DiCenzo       22.25